# Здесь лежит вся текстовая информация для бота: тексты ошибок, ответов и т.д.

greet = "Добрый день, Вы готовы забрать свой подарок? Вам нужно ответить на 3 вопроса! ☺️"

step_text1 = "В какое время удобнее принимать заказ?"
step_text2 = "Каким способом удобнее оплачивать?"
step_text3 = "Любите ли Вы подарки?"
step_text4 = "Я, дарю Вам 50% скидку на Первый заказ, по промокоду:- энжи017 (необходимо указать в комментарии к заказу) https://vodazhiznipenza.app11.ru/get Вы также сможете выбрать удобное для Вас время и способ оплаты, успейте оставить заявку до 15:30 и мы доставим уже сегодня!"
step_text_finished = ""
link_app_text = "Переходите по ссылке и забирайте свой подарок прямо сейчас: https://vodazhiznipenza.app11.ru/get"
info_company_text = "Вы также можете познакомиться и узнать все о компании RenЭнЖи , перейдя по ссылке ниже: https://yandex.ru/search/?text=%D1%80%D0%B5%D0%BD%D1%8D%D0%BD%D0%B6%D0%B8+%D0%BF%D0%B5%D0%BD%D0%B7%D0%B0&lr=49&clid=2270455&win=600"
statistics_text_question = "Выберите время за которое необходим вывести статистику"
statistics_text_answer = "Статистика за выбранное время"
admin_password_message = "Введите пароль администратора"
admin_password_error = "Ошибка. Введен неправильный пароль. Введите команду заново и попробуйте ввести пароль еще раз"
# Learn greet = "Привет, {name}, я бот, использующий нейросети от OpenAI, такие как ChatGPT и Dall-e. Задавай мне вопросы и я постараюсь ответить ☺️"
# menu = "📍 Главное меню"

gen_text = "📝 Отправьте текст запроса к нейросети для генерации текста"
gen_image = "🖼 Отправьте текст запроса к нейросети для генерации изображения"
gen_exit = "Чтобы выйти из диалога с нейросетью нажмите на кнопку ниже"
gen_error = f'🚫 Ошибка генерации. Возможные причины:\n1. Перегружены сервера OpenAI\n2. Ваш запрос нарушил правила OpenAI\n3. Ошибка в работе бота\nЕсли вы считаете, что проблема вызвана неисправностью бота, сообщите админу'
text_watermark = '\n_______________________________________\nСоздано при помощи @RenBot'
img_watermark = "Создано при помощи @RenBot"
gen_wait = "⏳Пожалуйста, подождите немного, пока нейросеть обрабатывает ваш запрос..."

err = "🚫 К сожалению произошла ошибка, попробуйте позже"